import os
import sys


window_size = 400


def clear():
    os.system('cls' if os.name == 'nt' else 'clear')


def main_menu():
    clear()
    print("""
    ██████████████████████████████████████████████████████████████
    █─███─█────█─███─█─██─█────█────█───█────██───█────█────█─██─█
    █─███─█─██─█─███─█─█─██─██─█─██─█─███─██──█─███─██─█─██─█─██─█
    █─█─█─█────█─█─█─█──███─██─█────█───█────██───█────█─████─█──█
    █─█─█─█─██─█─█─█─█─█─██─██─█─████─███─██──█─███─████─██─█──█─█
    █─────█─██─█─────█─██─█────█─████───█────██───█─████────█─██─█
    ██████████████████████████████████████████████████████████████""")
    print("\n1)Новая игра")
    print("2)Настройки")
    print("3)Правила")
    print("4)Выход")


def new_game():
    clear()
    print("""
    ██████████████████████████████████████████████████████████████
    █─███─█────█─███─█─██─█────█────█───█────██───█────█────█─██─█
    █─███─█─██─█─███─█─█─██─██─█─██─█─███─██──█─███─██─█─██─█─██─█
    █─█─█─█────█─█─█─█──███─██─█────█───█────██───█────█─████─█──█
    █─█─█─█─██─█─█─█─█─█─██─██─█─████─███─██──█─███─████─██─█──█─█
    █─────█─██─█─────█─██─█────█─████───█────██───█─████────█─██─█
    ██████████████████████████████████████████████████████████████""")
    print("\n1)PvP")
    print("2)PvE(скоро)")
    print("3)Назад")
    while True:
        user_input = input()
        if user_input == '1':
            clear()
            os.execl(sys.executable, sys.executable, './res/pvp.py')
            break
        #  elif user_input == '2':  TODO PvE
        #      pass
        elif user_input == '3':
            main_menu()
            break


def rules():
    clear()
    print("""
        ██████████████████████████████████████████████████████████████
        █─███─█────█─███─█─██─█────█────█───█────██───█────█────█─██─█
        █─███─█─██─█─███─█─█─██─██─█─██─█─███─██──█─███─██─█─██─█─██─█
        █─█─█─█────█─█─█─█──███─██─█────█───█────██───█────█─████─█──█
        █─█─█─█─██─█─█─█─█─█─██─██─█─████─███─██──█─███─████─██─█──█─█
        █─────█─██─█─────█─██─█────█─████───█────██───█─████────█─██─█
        ██████████████████████████████████████████████████████████████""")
    print("\nПравила:\n\n")
    print("""В начале игры у каждого игрока по 32 фишки.\n
    Каждый ход игрок может:\n
    1. Выставить шашку на поле своего цвета\n
    2. Передвинуть свою шашку в ближайшую по горизонтали клетку своего цвета\n
    3. "Съесть" шашку противника, если она стоит на соседней по горизонтали клетке,\n
    а клетка через шашак упротивника свободна.\n\n
    Игра заканчивается, если очередной ход игрока невозможен.\n
    Побеждает тот игрок, шашек цвета которого больше.\n""")
    print("1)Назад")
    while True:
        user_input = input()
        if user_input == '1':
            main_menu()
            break


def settings():
    clear()
    print("""
            ██████████████████████████████████████████████████████████████
            █─███─█────█─███─█─██─█────█────█───█────██───█────█────█─██─█
            █─███─█─██─█─███─█─█─██─██─█─██─█─███─██──█─███─██─█─██─█─██─█
            █─█─█─█────█─█─█─█──███─██─█────█───█────██───█────█─████─█──█
            █─█─█─█─██─█─█─█─█─█─██─██─█─████─███─██──█─███─████─██─█──█─█
            █─────█─██─█─────█─██─█────█─████───█────██───█─████────█─██─█
            ██████████████████████████████████████████████████████████████""")
    print("\n1)Размер окна")
    print("2)Назад")
    while True:
        user_input = input()
        if user_input == '1':
            clear()
            print("""
                       ██████████████████████████████████████████████████████████████
                       █─███─█────█─███─█─██─█────█────█───█────██───█────█────█─██─█
                       █─███─█─██─█─███─█─█─██─██─█─██─█─███─██──█─███─██─█─██─█─██─█
                       █─█─█─█────█─█─█─█──███─██─█────█───█────██───█────█─████─█──█
                       █─█─█─█─██─█─█─█─█─█─██─██─█─████─███─██──█─███─████─██─█──█─█
                       █─────█─██─█─────█─██─█────█─████───█────██───█─████────█─██─█
                       ██████████████████████████████████████████████████████████████""")
            print("\nРазмер окна: ")
            while True:
                user_input = input()
                try:
                    if int(user_input) > 0:  # TODO make sure that window size lower than resolution
                        window_size = int(user_input)
                        print("Настройки применены")
                        print("1)Назад")
                        while True:
                            user_input = input()
                            if user_input == '1':
                                settings()
                                break
                        break
                    else:
                        print("Неверный параметр, повторите ввод.")
                except ValueError:
                    print("Неверный параметр, повторите ввод.")
            break
        elif user_input == '2':
            main_menu()
            break


while True:
    main_menu()
    user_input = input()
    if user_input == '1':
        new_game()
    elif user_input == '2':
        settings()
    elif user_input == '3':
        rules()
    elif user_input == '4':
        clear()
        sys.exit()
